{"rules":"Core classes: Your character starts at level 0. At level 0 you have skills, but no class, class feats or regular feats. At level 1 you get to select a class, and recieve the class passives. However, you do not select a class feat until level 5. On selecting a class, you gain all of the passives listed, and get to choose between one of two listed feats. For any listed class, if it says \"Gain X Skill at 10\" that means you get to add the X skill to your skill list, and it starts at rank 10, meaning a +10% to any roll for that skill. At the first level taken in a class [other than level 1), you get the single star version of the feat. At level 5 and every 5 levels thereafter, you can choose to rank up the feat, or add the other feat to your character.",
"classes":
[{"name":"Soldier",
	"description":"You have the blood of a warrior flowing through you. Your sole purpose is to fight until the threat is neutrilized.",
	"Passives":["Gain Weapon Use(X) at 10", "Gain a +15 to Rolls for initiative (you go first more often)."],
	"Weapon Proficiencies": ["Pistols", "Submachine guns", "Carbines and Battle Rifles", "Shotguns", "Automatic Rifles"],
	"Armour Proficiencies": ["Light", "Medium", "Heavy"],
	"Class Feats":["Battle Cry / Raise Moral -You roar as you lead the charge against the enemy. 50% + (CHA mod) chance to raise allied effectivness 15% on each of their next rolls (including your next roll). You must use your next action to run towards enemies (minimum 1m). Allies must be able to hear and understand you to get the bonus. --> Either 75% + (CHA mod) success or 30% added to next allied rolls.",
	"It''ll heal (Min. Requirement of 7 fortitude) Make a FORT save at 50% to ignore an enemy damage. Remove one action next turn to stare down your enemy, curse at them hitting you, make a badass remark, etc. All damage taken during the encounter stacks, and half is taken at the end of the encounter, regardless of your condition. --> Fort save is at 75%, or you take 1/3 of damages dealt"]},
{"name":"Specialist",
	"description":"There is always a need for the type of person willing and able to bring the heaviest of fire down upon their enemies. The Specialist will be there when the odds are stacked highest against the forces for good, and he'll be prepared to use heavy force to even those odds.",
	"Passives":["Gain Thrown Weapons at 10."],
	"Weapon Proficiencies":[ "Pistols", "Carbines and Battle Rifles", "Heavy Weapons"],
	"Armour Proficiencies": ["Light", "Medium", "Heavy", "Full", "Concealed"],
	"Class Feats":
	["Needs more dakka - You fire off a hail of bullets to pin your enemy. Fire 4 shots for a full action, each shot DC +25%. If the target is still alive, they must pass a Shock DC of 50 or be pinned for 2 turns.-->Your ferocity knows no bounds. Fire off up to 6 shots, DC +25% for each.", 
	"Heavier Ordinance not required - Your expertise with heavy weapons is sufficient for the task at hand. -25% accuracy and +25 damage once per day for a heavy weapons attack.-->Your expertise with heavy weapons is overkill for the task at hand. -30% accuracy and +35 damage once per day for a heavy weapon attack."]},

{"name":"Doctor", 
	"description":"You know how or why something works (most likely humans / humanoid bodies), and put that knowledge to good use by supporting your team.",
	"Passives": ["Gain 5 skill in Anatomy", "Gain 5 skill in Pathology", "Gain 10 skill in medicine",  "Every level, you gain one skill in both of the \"hippocratic\" and \"malpractice\" skill trees", "At the beggining of each encounter, you begin with only half of your full count of nanites, but over the course of the battle, you may gain up to 600 nanites max."],
	"Weapon Proficiencies": ["Pistols", "Shotguns", "SMGs"],
	"Armour Proficiencies": ["Concealed", "Recon", "Light", "Medium"],
	"Class Feats":["Scalpel jockey - You can slice with the best of them, mostly because there really isn''t any competition for \"Best frenzied medic\" in these parts. 50% chance to stabilize an organic who is crashing, or heal 25 health.-->You''ve learned to use more than just your scalpel and some gauze. 75% chance success, or stabilize and heal 25 health, or just heal 50 health."]},
	
{"name":"Engineer",
	"description": "You solve problems. For insance, you know how to stop some mean mutha-hubbard from tearin'' you and your team a structurally supurfluous new behind. You know how to fix engines, machines, circuits, you name it. And when you''re not busy fixing what other people broke, you get to work on making new stuff. Which some knucklehead will probably eventually break too.",
	"passives": ["You gain get 10 skill points in repair", "Every level, you get one Process point in each of the \"repair\" and \"build\" skill trees",  "At the begining of an engagement, you start with only half of your nanites, but you may accrue up to 600 nanites max. You also start with 2 permanent control points, which enable control over any automatons you construct."],
	"Weapon Proficiencies": ["Pistol", "Carbine and Battle Rifles", "Shotgun"],
	"Armour Proficiencies": ["Concealed", "Recon", "Light", "Medium"],
	"Class Feats":[ "A little Controlling - You gain an additional permanant control point-->Control Phreak - You gain an additional permanant control point [max of 5 permanant points]",
		"Repairman - you gain a 10% chance to stabalize a crashing robotic ally and a +10% to repair checks.-->Overbuilt - Any time you build a construction, you may spend an additional 15 nanites to give that construction 50 additional health."]},

{"name":"Priest",
	"description": "you''ve lived your life in the deepest recesses of the holonet, and have come out alive, and strong. You can figure out how a security system works, hack into systems, or even hack your allys'' nanites to perform better.",
	"Passives": ["Gain PC use [HACKING] at 10 OR Knowledge [NANITES] at 10"],
	"Weapon Proficiencies": ["Pistols", "SMGs"],
	"Armour Proficiencies": ["Concealed", "Recon", "Light", "Medium"],
	"Class Feats":["Exploit weakness - You have a basic understanding of networks and computers, and can hack your way into a system with ease, and have accrued many basic hacks onto your thumb drive belt. +20% against Firewalls.-->Your skill and library have grown substantially. +30% against Firewalls, +15% against Info Nodes and Interaction Nodes.", 
	"Nanite Hacking - You''ve had some cross-training in the medical field, or maybe you just tried plugging a cord into your brain. You know how to communicate with Nanites present in friends and enemies. DC 50 Knowledge [Nanites] grants a +20% to ally''s next roll, or -10% on an opponent. Touch Effect.-->Nanites have almost become second nature to you. DC 50 Knowledge [Nanites] grants a +30% to ally''s next roll, or -15% on an opponent. Knowledge [Nanites] / 2 meters range."]},

{"name":"Pilot",
	"description": "You have a yearning to test the limits of the vehicles you operate. The boundaries of speed and maneuvering were meant to be broken - by you.",
	"Passives": ["Gain Piloting skill at 10."],
	"Weapon Proficiencies": ["Pistols", "Shotguns", "SMGs"],
	"Armour Proficiencies": ["Concealed", "Recon", "Light", "Medium"],
	"Class Feats":["Planes, Trains, Automobiles - This is sorta familiar to something you once saw, or rode on. Maybe? Unfamiliar vehicles can be operated [albeit pretty poorly] after you pass a DC 50 check, or take up to 3 actions examining.-->You have flown, operated and driven just about everything there is. Except that. Make a DC 40 check, or take up to 2 actions examining.",
	"Extensive training <Vehicle> - Your complete knowledge of <vehicle> makes your operation of it seem easy. Add 25 to any check concerning your operation, knowldege, or maintenence of the vehicle.-->You are THE guru accross the holonets for <vehicle>. Add 50 onto a pertinent roll about the vehicle."]}

]}